tech_notes/302_oauth2_rest_api_NOTES.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-11 Sat 12:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jim" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0b2c263">1. Two Years OLD - do not use**</a></li>
<li><a href="#org193075f">2. REST RESTful, HTTP Protocol , JSON, RFC, API and Web Technologies</a></li>
<li><a href="#org93d46c0">3. VERBS include GET/POST/ etc etc</a>
<ul>
<li><a href="#org1d58b8c">3.1. RESTFUL API (vs. graphQL) REF:  (ODATA is query tool for REST)</a></li>
<li><a href="#orgaa12702">3.2. REST &amp; OAUTH2 Vocabulary</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-05-04 Sat&gt;</span></span>:
</p>

<div id="outline-container-org0b2c263" class="outline-2">
<h2 id="org0b2c263"><span class="section-number-2">1</span> Two Years OLD - do not use**</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>bold</b>
<span class="underline">underline</span>
[ [nytimes][<a href="https://nytimes.com">https://nytimes.com</a>] ]
</p>

<div class="org-center">
<p>
hi
</p>
</div>
</div>
</div>


<div id="outline-container-org193075f" class="outline-2">
<h2 id="org193075f"><span class="section-number-2">2</span> REST RESTful, HTTP Protocol , JSON, RFC, API and Web Technologies</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>HTTP - best is Mozilla introduction</li>
<li>In practice, Restful API means built upon HTTP. (</li>
</ul>
<p>
do \(\exists\) non-HTTP )
</p>
<p>
*	originally URL linked to file or webpage.
</p>
<p>
*	more recenty, URI links to payload,  HTML/JSON/XML
</p>
<p>
*	RESTFUL provides stateless operations, architecture (vs SOAP, or others)
</p>
</div>
</div>
<div id="outline-container-org93d46c0" class="outline-2">
<h2 id="org93d46c0"><span class="section-number-2">3</span> VERBS include GET/POST/ etc etc</h2>
<div class="outline-text-2" id="text-3">
<p>
Stateless means server keeps no session information.   Each call to server is
independent.  Examples include HTTP, IP, REST.   But TCP is not stateless.
</p>
</div>


<div id="outline-container-org1d58b8c" class="outline-3">
<h3 id="org1d58b8c"><span class="section-number-3">3.1</span> RESTFUL API (vs. graphQL) REF:  (ODATA is query tool for REST)</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>OpenApi (api doc rules:  openapi.json or openapi.yaml; was Swagger) <a href="https://oai.github.io/Documentation/specification.html">https://oai.github.io/Documentation/specification.html</a></li>
<li>Postman - popular testing/setup site, many videos; `code` button to show
cURL, httr, curlR and many others
<ul class="org-ul">
<li>30-day tutorial: <a href="https://www.postman.com/postman/workspace/f1c6b0a9-b930-4165-9aa4-f655dd7051b5/overview">https://www.postman.com/postman/workspace/f1c6b0a9-b930-4165-9aa4-f655dd7051b5/overview</a></li>
</ul></li>
<li><a href="https://www.ics.uci.edu/~fielding/pubs/dissertation/top.htm">https://www.ics.uci.edu/~fielding/pubs/dissertation/top.htm</a>;</li>
<li><a href="https://en.wikipedia.org/wiki/Representational_state_transfer#Architectural_constraints">https://en.wikipedia.org/wiki/Representational_state_transfer#Architectural_constraints</a></li>
<li><a href="https://restfulapi.net/">https://restfulapi.net/</a></li>
<li><a href="http://www.cse.lehigh.edu/~spear/cse216_tutorials/tut_spark/index.html">http://www.cse.lehigh.edu/~spear/cse216_tutorials/tut_spark/index.html</a></li>
<li>Openstack (Cloud) <a href="https://docs.openstack.org/api-quick-start/">https://docs.openstack.org/api-quick-start/</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgaa12702" class="outline-3">
<h3 id="orgaa12702"><span class="section-number-3">3.2</span> REST &amp; OAUTH2 Vocabulary</h3>
<div class="outline-text-3" id="text-3-2">
<p>
(also:   [<a href="https://developer.mozilla.org/en-US/docs/Glossary">https://developer.mozilla.org/en-US/docs/Glossary</a>](<a href="https://developer.mozilla.org/en-US/docs/Glossary">https://developer.mozilla.org/en-US/docs/Glossary</a>) )     
BEST VIDEO:	oath2 5/27/20 "Like I am 5"
</p>


<p>
<b>Source of confusion?</b>    Bearer scheme is one of several authentication schemes <a href="https://www.iana.org/assignments/http-authschemes/http-authschemes.xhtml#authschemes">https://www.iana.org/assignments/http-authschemes/http-authschemes.xhtml#authschemes</a>; oauth is another.
Bearer token is same/different?    These definitions were created at different times for difference purposes:  hence confusion:
Think of Bearer token as just string rides in each request header. Authorization:   Bearer &lt;token&gt;   where token follows format for a bearer token.   Maybe do not add more than this?
</p>

<ul class="org-ul">
<li>USER - owns the 'resource'</li>
<li>client - your restful api software (aka app, R code, 3rd party, wants to access USER's resource;  usually must register with the resource.  Can be desktop or mobile app, or web app.</li>
<li><b>authorization code</b> - type of <b>grant</b>  for use case the resource owner is at keyboard/monitor to approve.</li>

<li><b><b>Authorization</b></b> Server - asks USER to approve request</li>
<li><b><b>Authorization</b></b> Code - returns to client software</li>
<li><b><b>Access</b></b>  - short term access (~ 1 hour).  Server gives to client.</li>
<li><b><b>BEARER</b></b> <b><b>TOKEN</b></b> - an Access Token of type BEARER; exchanged via header.</li>
</ul>
<p>
What is called bearer token is nothing more than something like:
</p>
<ul class="org-ul">
<li>rides in header, with requests,</li>
</ul>
<p>
Authorization:  Bearer &lt;access<sub>token</sub>&gt;
</p>
<ul class="org-ul">
<li>is a string, with constructed with 1 or alpha, digit, 
<ul class="org-ul">
<li>```</li>
</ul></li>
</ul>
<p>
The syntax for Bearer credentials is as follows:
</p>

<p>
     b64token    = 1*( ALPHA / DIGIT /
                       "-" / "." / "_" / "~" / "+" / "/" ) *"="
     credentials = "Bearer" 1*SP b64token
```
</p>

<p>
Authorization: Bearer AbCdEf123456
</p>

<ul class="org-ul">
<li><b><b>Refresh</b></b> Token - As needed client passes to server (+ secrets) in exchange for new Access</li>
</ul>
<p>
Token.  Refresh Token is longer lived.  Why this way?   Security mechanism.
</p>
<ul class="org-ul">
<li>Still need to know secrets to gain Access Token. Possession is
insufficient.</li>
<li><b><b>Implicit,</b></b> <b><b>password</b></b> - out-of-favor; do not use.</li>
<li><b><b>GRANT</b></b> <b><b>TYPES</b></b> - several; use only &#x2026;?</li>
<li><b><b>PKCE</b></b> -	additional security b/c authorization code can be compromised.</li>
<li><b><b>PAT or Personal Access Token (Github)</b></b> - Github's authentication method, of form</li>
<li>user:token (NOT user:password)</li>
<li>Google Service Account -	for non-interactive, machine-to-machine (so far I -have no need)</li>
<li>serialize - encode a string/object as &#x2026;..?</li>
</ul>
<ul class="org-ul">
<li>endpoint</li>
<li>url</li>
<li>uri</li>
<li>credentials - see RFC 6749</li>
<li>redirect<sub>uri</sub></li>
<li>oob -	only google used, considered obsolete mechanism in authorization
process.</li>
<li>httpuv, libuv -	low-level, set up sockets, I/O, events;  cross platform</li>
<li>JWT</li>
<li>native</li>
<li>policy</li>
<li>webhook -	client request and <b><b>listen</b></b>  Specify event and callback url.
Server responds only when event occurs.  CLAIM:  smart phones can not use
webhook (why?)</li>
</ul>




<p>
#### Curl REF:   
</p>
<ul class="org-ul">
<li>[<a href="https://everything.curl.dev/">https://everything.curl.dev/</a>](<a href="https://everything.curl.dev/">https://everything.curl.dev/</a>)</li>
<li><a href="https://stackoverflow.com/users/93747/daniel-stenberg">https://stackoverflow.com/users/93747/daniel-stenberg</a></li>
<li><a href="https://daniel.haxx.se/blog/">https://daniel.haxx.se/blog/</a></li>
</ul>

<p>
#### HTTP REF:
</p>
<ul class="org-ul">
<li>Command Line book:      <a href="https://datascienceatthecommandline.com/2e/index.html">https://datascienceatthecommandline.com/2e/index.html</a></li>
<li>JSON   <a href="https://cran.r-project.org/web/packages/jsonlite/index.html">https://cran.r-project.org/web/packages/jsonlite/index.html</a></li>
<li>HTTP protocol MDN <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP">https://developer.mozilla.org/en-US/docs/Web/HTTP</a></li>
<li>HTTP Header Fields <a href="https://en.wikipedia.org/wiki/List_of_HTTP_header_fields">https://en.wikipedia.org/wiki/List_of_HTTP_header_fields</a>, Media types (MIME):   <a href="https://www.iana.org/assignments/media-types/media-types.xhtml">https://www.iana.org/assignments/media-types/media-types.xhtml</a></li>
<li>HTTPS,  HTTP over TLS or SSL:  <a href="https://en.wikipedia.org/wiki/HTTPS">https://en.wikipedia.org/wiki/HTTPS</a></li>
<li>HTTP  mentioned by Hadley Wickham:
<ul class="org-ul">
<li><a href="https://code.tutsplus.com/tutorials/http-the-protocol-every-web-developer-must-know-part-1--net-31177">https://code.tutsplus.com/tutorials/http-the-protocol-every-web-developer-must-know-part-1--net-31177</a></li>
<li><a href="https://www.jmarshall.com/easy/http/">https://www.jmarshall.com/easy/http/</a>
<ul class="org-ul">
<li><a href="https://docs.python-requests.org/en/master/user/quickstart/">https://docs.python-requests.org/en/master/user/quickstart/</a></li>
<li>BNF notation, see !w</li>
</ul></li>
</ul></li>
</ul>

<p>
Media Types (was MIME): <a href="https://en.wikipedia.org/wiki/Media_type">https://en.wikipedia.org/wiki/Media_type</a>   
                        <a href="https://docs.github.com/en/rest/overview/media-types">https://docs.github.com/en/rest/overview/media-types</a>
#### OAUTH 2.1 (draft, expires July 2024) <a href="https://datatracker.ietf.org/doc/html/draft-ietf-oauth-v2-1-10">https://datatracker.ietf.org/doc/html/draft-ietf-oauth-v2-1-10</a>
(replaces and obsoletes the OAuth 2.0 Authorization Framework described in RFC 6749 and the Bearer Token Usage in RFC 6750.)
</p>

<p>
#### RFC REF: 
</p>
<ul class="org-ul">
<li>RFC 2616 HTTP protocol and terms:  <a href="https://www.rfc-editor.org/rfc/rfc2616">https://www.rfc-editor.org/rfc/rfc2616</a></li>
<li>RFC 2617 Basic Authentication:	 <a href="https://www.rfc-editor.org/rfc/rfc2617">https://www.rfc-editor.org/rfc/rfc2617</a></li>
<li>RFC 3986 + RFC 8820 URI/URL</li>
<li>RFC 6749 OAUTH 2.0 <a href="https://www.rfc-editor.org/rfc/rfc6749">https://www.rfc-editor.org/rfc/rfc6749</a>   (SEE OAUTH 2.1)</li>
<li>RFC 6750 Bearer Token: <a href="https://datatracker.ietf.org/doc/html/rfc6750">https://datatracker.ietf.org/doc/html/rfc6750</a> (SEE OAUTH 2.1)</li>
</ul>
<p>
SOAP <a href="https://en.wikipedia.org/wiki/SOAP">https://en.wikipedia.org/wiki/SOAP</a>
URI  <a href="https://en.wikipedia.org/wiki/Uniform_Resource_Identifier">https://en.wikipedia.org/wiki/Uniform_Resource_Identifier</a>
</p>



<p>
#### OAUTH 2.0,  Security , Authentication, REF
</p>

<ul class="org-ul">
<li>Token, Service Account:  <a href="https://gargle.r-lib.org/articles/get-api-credentials.html#service-account-token">https://gargle.r-lib.org/articles/get-api-credentials.html#service-account-token</a></li>
<li>OAuth 2.0 Protocol (<a href="https://datatracker.ietf.org/doc/html/rfc6749">https://datatracker.ietf.org/doc/html/rfc6749</a>)</li>
<li>oob (out-of-band)  <a href="https://docs.auth3.dev/grant-types/urn-ietf-wg-oauth-2.0-oob">https://docs.auth3.dev/grant-types/urn-ietf-wg-oauth-2.0-oob</a> (use their</li>
</ul>
<p>
identity server for standard RFC methods)
</p>
<ul class="org-ul">
<li>openSSL</li>
<li><a href="https://developer.okta.com/">https://developer.okta.com/</a></li>
<li><a href="https://oauth.net">https://oauth.net</a></li>
<li>microsoft/open<sub>id</sub>:  <a href="https://docs.microsoft.com/en-us/azure/active-directory/develop/v2-protocols-oidc">https://docs.microsoft.com/en-us/azure/active-directory/develop/v2-protocols-oidc</a></li>
<li>auth0.com: <a href="https://auth0.com/docs/get-started">https://auth0.com/docs/get-started</a>
<ul class="org-ul">
<li>openID:  <a href="https://en.wikipedia.org/wiki/OpenID">https://en.wikipedia.org/wiki/OpenID</a></li>
<li>letsencrypt.org | ISRG.org ? | source for free?  CA</li>
</ul></li>
</ul>

<p>
#### Popular APIs 
</p>
<ul class="org-ul">
<li>GitHub API <a href="https://docs.github.com/en/rest">https://docs.github.com/en/rest</a></li>
<li>GitLab API <a href="https://vulpes.cba.mit.edu/help/api/index.md">https://vulpes.cba.mit.edu/help/api/index.md</a></li>
<li>Spotify (api + authorization): <a href="https://developer.spotify.com/documentation/general/guides/">https://developer.spotify.com/documentation/general/guides/</a></li>
<li>Spotify &amp; Postman:  <a href="https://www.youtube.com/watch?v=5TNQf2gBrd8">https://www.youtube.com/watch?v=5TNQf2gBrd8</a></li>
<li>Dropbox: <a href="https://www.dropbox.com/developers">https://www.dropbox.com/developers</a></li>
<li>Predictit.org: <a href="https://www.predictit.org/api/marketdata/all/">https://www.predictit.org/api/marketdata/all/</a>  (xml dump,</li>
</ul>
<p>
must write you own functions)
</p>
<ul class="org-ul">
<li>ConstantContact: <a href="https://v3.developer.constantcontact.com/">https://v3.developer.constantcontact.com/</a>
<ul class="org-ul">
<li>Glitch - site acts like server in-between API source and user	?</li>
</ul></li>
</ul>


<p>
####	Google Specific
</p>
<ul class="org-ul">
<li>Google Identity (<a href="https://developers.google.com/identity">https://developers.google.com/identity</a>)</li>
<li>Google OAuth2.0 implementation (<a href="https://developers.google.com/identity/protocols/oauth2#installed">https://developers.google.com/identity/protocols/oauth2#installed</a>)</li>
<li>google people api  <a href="https://developers.google.com/people/">https://developers.google.com/people/</a></li>
<li>google web fonts api</li>
<li>Google Cloud  <a href="https://cloud.google.com/">https://cloud.google.com/</a></li>
<li>Google Cloud Platform  <a href="https://console.developers.google.com/products">https://console.developers.google.com/products</a> <a href="https://en.wikipedia.org/wiki/Google_Cloud_Platform">https://en.wikipedia.org/wiki/Google_Cloud_Platform</a></li>
<li>For Youtube (installed apps, like R): <a href="https://developers.google.com/youtube/v3/guides/auth/installed-apps">https://developers.google.com/youtube/v3/guides/auth/installed-apps</a></li>
</ul>

<p>
#### R and related
</p>

<ul class="org-ul">
<li>curl::  (based on C library used in cURL) <a href="https://jeroen.cran.dev/curl/index.html">https://jeroen.cran.dev/curl/index.html</a></li>
<li>cloudyR project</li>
<li>curlconverter:: <a href="https://github.com/hrbrmstr/curlconverter">https://github.com/hrbrmstr/curlconverter</a></li>
<li>fakerapi.it fakerapi <a href="https://fakerapi.it/en">https://fakerapi.it/en</a></li>
<li>gargle::   good intro (<a href="https://www.tidyverse.org/blog/2021/07/gargle-1-2-0/">https://www.tidyverse.org/blog/2021/07/gargle-1-2-0/</a>)</li>
<li>httptest2:: <a href="https://enpiar.com/httptest2/index.html">https://enpiar.com/httptest2/index.html</a></li>
<li>httpuv, libuv
<ul class="org-ul">
<li><a href="https://cran.r-project.org/package=httpuv">https://cran.r-project.org/package=httpuv</a></li>
<li><a href="https://nikhilm.github.io/uvbook/introduction.html">https://nikhilm.github.io/uvbook/introduction.html</a>  (low-level, C code, but good sense of what is happening)</li>
</ul></li>
<li>httr2::
<ul class="org-ul">
<li>github <a href="https://github.com/r-lib/httr2">https://github.com/r-lib/httr2</a></li>
<li>cran <a href="https://cloud.r-project.org/web/packages/httr2/index.html">https://cloud.r-project.org/web/packages/httr2/index.html</a></li>
</ul></li>
<li>plumber</li>
</ul>


<p>
\newpage
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jim</p>
<p class="date">Created: 2024-05-11 Sat 12:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
